<template>
  <div>
    <van-sticky>
      <van-nav-bar
          title="源易控用户协议"
          left-text=""
          left-arrow
          @click-left="onClickLeft"
      />
    </van-sticky>
    <h3 class="tc">{{ text }}</h3>
    <div v-for="item in paragraph">
      <h4 class="m10">{{ item.paragraphTitle }}</h4>
      <div v-for="itemKey in item.paragraphContent">
        <div class="m10" style="text-indent:2em">{{ itemKey.content }}</div>
      </div>
    </div>
  </div>
</template>

<script lang="ts" setup>
import {useRouter} from "vue-router";
const router = useRouter();
const onClickLeft = () => router.replace('/login');
const text = '源易控用户协议';
const paragraph = [
  {
    'paragraphTitle': '',
    'paragraphContent':
        [
          {
            'content': '您与天津神州浩天教育科技有限公司及相关主体（下称“源易控”）本着平等、互利、友好协商的原则，就您使用源易控提供的服务（下称“源易控服务”或“服务”）等相关事宜达成一致，签订本协议，以资共同遵守。'
          },
          {
            'content': '【签约主体】 视您所使用的具体服务而定，“源易控”是指源易控旗下运营或提供您所使用的相关具体服务的相关主体的统称，您可在相关服务的具体服务条款或说明文件中查看上述主体的名称和信息。 “用户”是指使用源易控相关服务的使用人，在本服务协议中更多称呼为“您”。'
          },
          {
            'content': '本服务协议适用于网页端、移动客户端（包括 iOS、安卓及已有或未来将新增的任何其他移动客户端）等各类平台或钉钉、飞书等媒介中源易控所提供的各项服务。您知悉并理解，为享受上述相关服务，您必须自行提供相关上网设备（如：个人电脑、手机、平板电脑或其他设备）并自行负担相关网络使用和商品服务支付所产生的有关费用。'
          },
        ]
  },
  {
    'paragraphTitle': '一、您的权利和义务：',
    'paragraphContent':
        [
          {
            'content': '1.您依法享有知悉其购买、使用源易控产品，接受源易控提供的各项服务的权利。'
          },
          {
            'content': '2.您向源易控提供有关资料信息时，有权知悉其所提供信息的使用目的，使用范围、安全保护措施以及未提供真实信息的后果。您享有账户资料、交易信息受保护的权利。'
          },
          {
            'content': '3.您在购买源易控产品或接受源易控服务之前，有权知悉源易控所提供的产品或服务的风险信息。'
          },
          {
            'content': '4.您有权申请源易控账户信息查询、注销。若您需对源易控账户进行挂失，应及时与源易控客服人员联系，并按相关要求进行操作。如您发现有他人冒用、盗用或未经您授权使用其源易控账户或操作其资金，可向源易控发起挂失，并按照源易控规定办理相关手续，源易控应采取必要措施予以配合。源易控自接到您通知之时起应尽快处理您的暂停服务请求，源易控对在处理完毕前述请求之前已执行的指令所导致的您的损失不承担任何责任。'
          },
          {
            'content': '5.您使用源易控的产品或服务过程中，可通过源易控网站的在线客服或客户服务电话与源易控联系，并获取相关的技术和服务支持。'
          },
          {
            'content': '6.您核对汇总和明细对账单发现不符情况的，应及时向源易控投诉或反馈，源易控应设置专门的岗位接受投诉或反馈，分析差错原因，并根据情况进行差错处理。'
          },
          {
            'content': '7.您在申请开立源易控账户时，应向源易控如实提供开立账户所需的全部材料。您应保证上述提交资料的合法性、真实性、准确性和完整性。若您上述信息发生变更，应提前5个工作日通知源易控，并依据源易控要求配合完成变更确认手续。因您未能及时通知源易控并更新上述信息导致服务无法提供或提供时发生任何错误的，您不得将此作为取消交易、拒绝付款的理由，您将承担因此产生的一切后果，源易控不承担任何责任。'
          },
          {
            'content': '若源易控有合理理由怀疑您提供的身份证件信息及相关资料错误、不实、过时或不完整的，或因国家法律法规、部门规章或监管机构的要求，源易控需要您补充提供任何相关资料时，如您不能及时配合提供的，源易控有权暂停或终止向您提供部分或全部服务。源易控对此不承担任何责任，您应承担因此产生的任何直接或间接支出。'
          },
          {
            'content': '8.您不得把源易控账户用于本协议约定范围以外的其他用途，也不得出租、转让、出借、赠与给第三方使用。'
          },
          {
            'content': '9.您应妥善保管其在源易控开立的源易控账户及其密码，以及安全认证工具。对于因您个人原因导致的该账户信息、身份信息泄露所致的损失，由您自行承担。'
          },
          {
            'content': '10.您使用源易控的网银付产品服务时，应确保自身发出支付指令的合法性、真实性、有效性和完整性。'
          },
          {
            'content': '11.您应承诺发起的网银付、虚拟卡等交易基于真实的交易背景，不得利用源易控提供的服务进行虚假交易。 源易控有权了解您使用源易控产品或服务的真实交易背景及目的，您应如实提供源易控所需的真实、全面、准确的信息；如果源易控有合理理由怀疑您提供虚假交易信息的，源易控有权暂时或永久限制您所使用的服务的部分或全部功能，且不承担任何责任。'
          },
          {
            'content': '12.您不得利用源易控的服务从事任何非法行为，不将源易控服务用于任何非法目的，也不以任何非法方式使用源易控服务。不得违反中国法律、法规、规章、规范性文件及政策，不得侵犯他人的合法权益。如您是中国大陆以外的用户，还需同时遵守其所属国家或地区的法律。'
          },
          {
            'content': '13.您不得对源易控的服务系统和程序采取反向工程手段进行破解，不得对上述系统和程序（包括但不限于源程序、目标程序、软件文档、运行在本地电脑内存中的数据、客户端至服务器端的数据、服务器数据等）进行复制、修改、编译、整合和篡改，不得修改或增加源易控服务系统的原有功能。'
          },
        ]
  },
  {
    'paragraphTitle': '二、源易控的权利和义务',
    'paragraphContent':
        [
          {
            'content': '1.源易控负责系统的建设、运行和管理，应确保该系统的安全性。'
          },
          {
            'content': '2.源易控对您身份资料及支付信息负有保密义务，源易控不得利用您的上述信息从事超出法律许可及未经您授权的活动。'
          },
          {
            'content': '3.源易控应为您提供本协议约定的各项产品或服务功能，并可按照约定向您收取相关服务费用。'
          },
          {
            'content': '4.源易控应以明确的格式、内容、语言，对其提供的产品或服务，依法向您进行全面、充分的信息披露和风险提示。'
          },
          {
            'content': '5.源易控应保护甲乙双方合作期内获得的您身份基本信息、业务信息、会计档案等资料的安全，防止其被篡改、灭失、损毁或泄露。'
          },
          {
            'content': '6.源易控应充分尊重您自主选择权，不得强迫您使用源易控提供的服务，不得阻碍您使用其他机构提供的服务。'
          },
          {
            'content': '7.您故意诋毁或非法损害源易控声誉的，源易控可立即终止提供服务，并追偿损失。'
          },
          {
            'content': '8.源易控可拒绝支付或追索您违反国家法律法规或本协议约定的有关款项。'
          },
          {
            'content': '9.源易控应当妥善处理与您之间发生的差错争议和纠纷投诉，做好协调和解释工作，并及时告知您结果。'
          },
          {
            'content': '10.为提供更高效和优质的服务，源易控可根据运营需要对服务系统进行升级，因升级需要暂停或中止提供服务的，源易控应提前在网站显著位置进行公告，并预告恢复日期。'
          },

        ]
  },
  {
    'paragraphTitle': '三、服务内容',
    'paragraphContent':
        []
  },
  {
    'paragraphTitle': '（一）源易控账户开立',
    'paragraphContent':
        [
          {
            'content': '1.您应遵循诚实信用、合法善意的原则，向源易控提交相关注册资料，相关注册资料应当遵守法律法规、社会主义制度、国家利益、公民合法权益、公序良俗、信息真实等原则，不应提交任何违法或不良信息，相关资料如有变动，您应及时更新。如果因您所提供的注册资料不合法、不真实、不准确或未及时更新，从而导致相关法律责任或不利后果的，您将承担相应的法律责任及不利后果。'
          },
          {
            'content': '2.您已知悉，在源易控账号注册过程中，因安全性、内部管理等原因，部分初始注册资料可能将无法再次更改。因此，您应谨慎核查此部分注册资料，确保正确填写。'
          },
          {
            'content': '3.因国家法律法规、监管要求及特定门类的服务（如金融服务等） 需要，您有可能需要在注册或使用该等服务的特定环节中填写真实的身份信息，并需通过相关验证流程后方可使用服务，如您填写的身份信息不完整、不真实或未通过验证，将导致您无法使用该服务、损害自身、他人利益或造成其他不利后果，该等后果将由您予以承担。'
          },
          {
            'content': '4.源易控将对您所提交的注册信息予以保护，不会将其披露给任何非关联的第三方，除非：'
          },
          {
            'content': '（1）相关法律法规或国家机关要求；'
          },
          {
            'content': '（2）源易控发生相关合并、分立、收购或资产转移；'
          },
          {
            'content': '（3）为提供相关服务所必须的。'
          },
          {
            'content': '5.对于您所提交的注册信息中涉及个人信息的内容，源易控将严格按照《源易控平台隐私规则》的规定进行收集、处理和使用。'
          },
          {
            'content': '6.您应对您账号项下的所有行为（包括但不限于在线签署任何协 议，浏览、购买、支付、点评、上传、发布、输入任何内容）所产生的一切后果负责，通过您的账号所发生的上述各项行为将视为您本人的真实意思表示。'
          },
          {
            'content': '7.为保证相关账号安全，未经源易控的书面同意，您不应将源易控平台上所注册的账号借给他人使用，否则您应当承担由此产生的全部责任，源易控平台保留拒绝提供相应服务、冻结或收回注册账号或终止本服务协议的权利，并可要求您对源易控所承受的损失予以赔偿。'
          },
          {
            'content': '8.如您发现账号存在安全问题，请您立即联系源易控予以调查处理，否则源易控对潜在损失的产生或扩大不承担任何责任。'
          },
          {
            'content': '9.源易控特别提示您，您应该妥善保管您的账号和密码，当您使用完毕源易控的服务后，您应安全退出。此外，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意源易控有关防范诈骗犯罪的提示。您知悉并同意，如您在账号信息的保管上、相关上网设备的网络安全维护上存在任何过失导致账号丢失、泄露，您应对此所产生的任何后果负责，源易控对此不负任何责任，如源易控因此产生相关支出，源易控将有权向您予以追偿。'
          },
        ]
  },
  {
    'paragraphTitle': '（二）源易控账户的注销',
    'paragraphContent': [
      {
        'content': '在需要终止使用源易控服务时，您应当依照源易控规定的程序注销您的源易控账户，您同意：'
      },
      {
        'content': '1. 您仅能申请注销您本人的源易控账户，该源易控账户注销后，您将无法使用源易控的任何服务，双方的权利义务终止（本协议另有约定不得终止的或依其性质不能终止的除外）。您的源易控账户一经注销成功，将无法恢复。'
      },
      {
        'content': '2.您申请注销的源易控账户应当不存在任何由于该账户被注销而导致的未了结的权利义务或其他因为注销该账户会产生纠纷的情况，不存在任何未完结交易，没有余额，或源易控认为注销该账户会由此产生未了结的权利义务而产生纠纷的情况。否则，源易控有权拒绝您的注销申请。'
      },
    ]
  },
  {
    'paragraphTitle': '四、源易控服务规则及相关声明',
    'paragraphContent': [
      {
        'content': '为有效保障您使用源易控服务时的合法权益，您理解并同意接受以下规则：'
      },
      {
        'content': '（一）本服务的具体内容以源易控实际提供的功能及服务内容为准，包括但不限于授权用户通过其账号向您提供报销费控平台、商旅产品预订、网银付、虚拟卡等产品服务、满足您的个性化需求、例如，语言设定、位置设定、个性化的帮助服务、产品开发和服务优化、安全保障、向您推荐可能有帮助的资讯、邀请您参与有关我们服务的调查等。源易控可以对其提供的服务予以变更，且提供的服务内容可能随时变更；用户将会收到源易控关于服务变更的通知。'
      },
      {
        'content': '（二）您在使用源易控服务过程中，本协议内容、网页上出现的关于操作的提示或源易控发送到该手机的信息（短信或电话等）内容是您使用源易控服务的相关规则，您使用源易控服务即表示您同意接受源易控服务的相关规则。'
      },
      {
        'content': '（三）源易控会以电话/短信/电子邮件等方式通知您资金变动情况以及提示您进行下一步操作，但源易控不保证您能够收到或者及时收到前述信息，且不对此承担任何后果，因您没有及时进行下一步操作或未能提交相关申请而导致的任何纠纷或损失，源易控不负任何责任。'
      },
      {
        'content': '（四）源易控会将与您源易控账户相关的资金独立于源易控营运资金之外，且不会将该资金用于非您指示的用途，但支付规则约束的交易及本条第（五）款约定的除外。'
      },
      {
        'content': '（五）您不得将源易控服务用于非源易控许可的其他用途。'
      },
      {
        'content': '（六）源易控并非银行或其它金融机构，源易控服务也非金融业务，本协议项下的资金移转均通过银行来实现，您理解并同意您的资金于流转途中的合理时间。'
      },
      {
        'content': '（七）在您开立源易控账户使用源易控服务时，您授权源易控通过银行或第三方依法审核、验证您的身份和资格。'
      },
    ]
  },
  {
    'paragraphTitle': '五、资金结算方式',
    'paragraphContent': [
      {
        'content': '1.对于网银付产品，源易控有权根据您的支付指令，自您的交易款中直接扣除相关服务费用后（如有），应按本协议约定或您签署的其他协议约定，委托第三方银行将您的交易款项划转到您指定的收款账户，具体到账时间以银行实际入账时间为准。'
      },
      {
        'content': '2.如您与源易控针对支付交易存在误差，双方应进行核对；如无法达成一致，应以源易控服务系统记录的数据为准。'
      },
      {
        'content': '3.源易控服务所涉及到的任何款项只以人民币计结，不提供任何形式的结、售汇业务。'
      },
    ]
  },
  {
    'paragraphTitle': '六、知识产权、保密条款及廉洁条款',
    'paragraphContent': []
  },
  {
    'paragraphTitle': '（一）知识产权',
    'paragraphContent': [
      {
        'content': '1.在本协议签订和履行过程中，源易控对支付服务相关的系统、程序、文档、商业标识、产品和服务等享有知识产权，这些内容受法律保护。'
      },
      {
        'content': '2.您因履行本协议需要使用以上权利的，应经源易控明确的书面许可。源易控的书面授权不构成任何形式的权利转让。'
      },
    ]
  },
  {
    'paragraphTitle': '（二）保密条款',
    'paragraphContent': [
      {
        'content': '1.在签署或履行本协议过程中，甲、乙双方对了解或接触到的涉及对方的业务、技术、财务及其他方面未公开的资料和信息等商业秘密（下称“保密信息”），均应保守秘密。'
      },
      {
        'content': '2.非经一方书面同意，另一方不得向第三方透露该保密信息，也不得以不正当方式使用或授权他人使用该保密信息。收到保密信息的一方应当采取措施保护保密信息，防止信息被擅自使用、散布或公开。但因相关法律、法规的明确规定，必须向有关机构、国家政府部门及公众披露的除外。'
      },
      {
        'content': '3.上述保密义务不因本协议的终止而失效。'
      },
    ]
  },
  {
    'paragraphTitle': '（三）廉洁条款',
    'paragraphContent': [
      {
        'content': '1.各方不得向对方及其关联方之员工、顾问提供任何形式的不正当利益。如有，则视为根本性违约，守约方有权提前部分或全部终止本协议，且违约方应按本协议总价款的10％或提供任何形式的不正当利益的总金额或守约方遭受的全部损失，三者中较高的一项向守约方进行赔偿。'
      },
      {
        'content': '2.“关联方”就您、源易控而言，是指其控制、与其共同控制一方或对一方施加重大影响的，或者与其同受一方控制、共同控制或重大影响的实体（其中“控制”及“重大影响”的定义以中国有效的企业会计准则的规定为准）。'
      },
    ]
  },
  {
    'paragraphTitle': '七、不可抗力及免责事由',
    'paragraphContent': [
      {
        'content': '1.不可抗力，是指不可预见、不可克服、即使预见亦无法避免的事件，该事件妨碍、影响或延误任何一方根据协议履行其全部或部分义务。该事件包括但不限于法律法规变化或有新的法律法规，政策调整或有新的政策规定，政府行为，自然灾害，战争，恐怖袭击或任何其它类似事件。'
      },
      {
        'content': '2.出现不可抗力事件时，知情的一方应及时以书面形式向对方发出通知，并告知对方该类事件对本协议产生或可能产生的影响，并应当在合理期限内提供相关证明。'
      },
      {
        'content': '3.由于银行、电信运营商系统故障、调整升级，或电力中断，或现有技术能力无法防御的黑客攻击、技术故障等原因造成源易控支付服务系统无法正常运作的，不视为源易控违约。'
      },
      {
        'content': '4.因上述不可抗力事件或免责事由致使本协议的部分或全部不能履行或延迟履行，甲、乙双方于彼此间不承担任何违约责任，但对怠于履行通知义务所导致的对方损失不能免责。'
      },
      {
        'content': '5.本协议内受影响的条款可在不能履行的期间及受影响的范围内中止履行，待不可抗力情形消失后，双方应当恢复履行。'
      },
    ]
  },
  {
    'paragraphTitle': '八、风险提示及特别约定',
    'paragraphContent': [
      {
        'content': '1.如您在使用源易控服务过程中涉及上述行为中的一项或多项，则需要对自己的行为承担法律责任。承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在源易控首先承担了因您的行为导致的行政处罚或侵权损害赔偿责任等损失（含诉讼费、律师费等相关法律程序费用）后，您应立即给予源易控等额的赔偿。此外，根据具体违法违规情形，源易控有权作出独立判断，立即暂停或终止对您提供部分或全部服务，包括锁定、注销、删除帐号等措施。同时，您同意，如因您的行为造成他人经济损失的，源易控可出于公共利益保护、消费者保护、商业利益保护等原则，在合法合规的前提下，从您的源易控账户（如有）中划扣相应款项，您同意并授权、委托源易控进行上述划扣操作。'
      },
      {
        'content': '2.您知悉并理解，如果源易控发现您的上述违法违规行为，依据相关法律法规的规定，源易控有权或有义务立即停止相关服务，删除或屏蔽相关违规信息、服务评价，并视情况进行调查取证，保存有关记录，或向国家有关机关举报。同时， 源易控有权自主删除、屏蔽含有该内容的任何数据信息。源易控将根据国家相关法律法规要求，对依法删除、屏蔽的数据信息予以记录、保存。'
      },
      {
        'content': '3.您理解并同意：为向您提供更为细致、贴心的服务，在经过您的事先确认后，源易控或源易控授权、认可的第三方供应商可能通过您注册时填写的手机号码或者电子邮箱向您发送您可能感兴趣的商品服务的广告宣传信息、促销优惠等商业性信息，其方式和范围可不经向您特别通知而变更；如果您不愿意接收此类信息，则您有权通过源易控平台提供的相应的退订方式进行退订。'
      },
      {
        'content': '4.您不得利用源易控提供的服务进行任何形式的洗钱、虚假交易、资金非法套现及其它违法行为。若源易控发现您违反本约定的，源易控可立即暂停、中止或终止支付服务，向公安部门报案，且将相关信息报送有关部门。'
      },
    ]
  },
  {
    'paragraphTitle': '九、源易控服务使用限制',
    'paragraphContent': [
      {
        'content': '（一）您不得利用源易控服务从事侵害他人合法权益之行为，否则源易控有权拒绝提供源易控服务，且您应承担所有相关 法律责任，因此导致源易控或源易控雇员受损的，您应承担赔偿责任。上述行为包括但不限于：'
      },
      {
        'content': '1.侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。'
      },
      {
        'content': '2.违反依法定或约定之保密义务。'
      },
      {
        'content': '3.冒用他人名义使用源易控服务。'
      },
      {
        'content': '4.从事不法交易行为，如洗钱、恐怖融资、贩卖枪支、毒品、禁药、盗版软件、黄色淫秽物品、其他源易控认为不得使用源易控服务进行交易的物品等。'
      },
      {
        'content': '5.提供赌博资讯或以任何方式引诱他人参与赌博。'
      },
      {
        'content': '6.非法使用他人银行账户（包括信用卡账户）或无效银行账号（包括信用卡账户）交易。'
      },
      {
        'content': '7.违反《银行卡业务管理办法》使用银行卡，或利用信用卡套取现金（以下简称套现）。'
      },
      {
        'content': '8.进行与您或交易对方宣称的交易内容不符的交易，或不真实的交易。'
      },
      {
        'content': '9.其他源易控有正当理由认为不适当之行为。'
      },
      {
        'content': '（二）您理解并同意，源易控不对因下述任一情况导致的任何损失承担赔偿责任，包括但不限于利润、商誉、数据等方面的损失或其他无形损失的损害赔偿：'
      },
      {
        'content': '1.若源易控认为您存在下列情形之一时，源易控有权基于单方判断，不经通知先行暂停、中断或终止您名下全部或部分源易控账户的使用并采取相关限制措施（包括但不限于对这些账户名下的款项和在途交易采取取消交易、冻结等），并拒绝向您提供源易控服务之部分或全部功能，并移除您的资料。'
      },
      {
        'content': '（1）源易控认为您已经违反本协议的明文规定及精神；'
      },
      {
        'content': '（2）源易控发现您的交易存在异常或对您的交易有疑义；'
      },
      {
        'content': '（3）源易控认为您的交易有违反法律法规规定之可能；'
      },
      {
        'content': '（4）源易控认为您收入或支付的款项金额及/或操作频次不同于往常；'
      },
      {
        'content': '（5）政府依行政职权的要求的。'
      },
      {
        'content': '2.如果源易控对您的源易控账户采取相关限制措施，源易控将会采取电话/短信/电子邮件等方式通知您，但源易控不保证您能够收到或者及时收到该通知，且不对此承担任何后果。'
      },
      {
        'content': '3.在源易控认为上述情形已经得到合理解释或存在有效证据证明不存在上述情形的，源易控最晚将于采取限制措施之日起的60日内解除限制措施。解除上述限制措施时，您应当配合源易控核实您的身份情况，提供包括但不限于身份信息、经营内容文件及源易控要求的其他信息或文件。但源易控有进一步理由相信上述情形仍可能对您或其他用户或源易控造成损失的情形除外，包括但不限于（1）源易控收到针对上述情形的投诉的；（2）您已经实质性违反了本协议或另行签署的服务协议，且我们基于保护各方利益的需要必须继续采取限制措施的；（3）您虽未违反国家相关法律法规及部门规章的规定，但您的使用涉及源易控规定的限制合作的行业类目或商品，包括但不限于通过源易控的产品或服务从事类似金字塔或矩阵型的高额返利业务模式。'
      },
      {
        'content': '（三）如您需要注销您的源易控账户，应先经源易控审核同意。您的源易控账户注销后，您仍应对您使用源易控服务期间的行为承担可能的违约或损害赔偿责任，同时源易控仍可保有您的相关信息。'
      },
    ]
  },
  {
    'paragraphTitle': '十、隐私权保护',
    'paragraphContent': [
      {
        'content': '一旦勾选同意并接受本协议，您即同意源易控按照以下条款来使用和披露您的个人信息及其他相关信息。具体请参考《源易控用户隐私权规则》。'
      },
      {
        'content': '（一）用户信息。您开户时应提供包括但不限于您的真实姓名或名称、身份证号码、营业执照副本、法定代表人身份证明、通讯地址、电话号码和电子邮件地址等源易控要求的信息。您还可以选择填写相关附加信息。为有针对性地向您提供新的服务，您同意源易控及关联公司向您发送相关通知及其他商业性电子信息，如果您不再愿意接收前述商业性电子信息时，您可通过其中的指示步骤进行操作以取消该同意。'
      },
      {
        'content': '（二）银行账户信息。源易控所提供的服务须您提供您的银行账户信息，在您提供相应信息后，源易控将严格履行相应保密约定。'
      },
      {
        'content': '（三）交易行为。为了保障您使用源易控服务的安全以及不断改进服务质量，源易控将记录并保存您使用源易控服务的相关信息，但源易控承诺不将此类信息提供给除源易控关联公司之外的任何第三方（双方另有约定或法律法规另有规定的除外）。'
      },
      {
        'content': '（四）为更安全有效地向您提供服务，根据法律法规的规定，或源易控需识别您的身份，或源易控认为您的账户存在风险时，源易控有权要求您提交身份信息。除本协议另有约定，或法律法规规定，或政府主管部门，或监管机构要求外，源易控不对外公开或向第三方提供您的信息，但以下情况除外：'
      },
      {
        'content': '1.事先获得您的明确授权的；'
      },
      {
        'content': '2.只有披露您的资料，才能提供您需要的产品和（或）服务的'
      },
      {
        'content': '3.为维护源易控及其关联公司的合法权益的；'
      },
      {
        'content': '4.对您的身份真实性进行验证的。'
      },
    ]
  },
  {
    'paragraphTitle': '十一、适用法律及争议解决',
    'paragraphContent':
        [
          {
            'content': '1.本协议的解释、适用、争议解决等一切事宜，均适用中华人民共和国法律（香港特别行政区、澳门特别行政区和台湾地区的法律除外），冲突法规则除外。 没有相关法律规定的，参照通用国际商业惯例和（或）行业惯例。'
          },
          {
            'content': '2.因本协议产生任何纠纷时，各方应友好协商，协商不成的，各方应将争议提交被告住所地有管辖权的人民法院诉讼解决。'
          },
        ]
  },
  {
    'paragraphTitle': '十二、违约责任',
    'paragraphContent':
        [
          {
            'content': '1.甲、乙双方中的任何一方违反在本协议中所做的保证、承诺或其他条款，均构成违约，因违约而给另一方造成损失的，违约方应承担赔偿责任。'
          },
          {
            'content': '2.一方违约后，非违约方应当采取适当措施防止损失的扩大，没有采取适当措施致使损失扩大的，非违约方不得就扩大的损失要求赔偿。非违约方因防止损失扩大而支出的合理费用，由违约方承担。'
          },
          {
            'content': '3.如您违约并给源易控造成经济损失的，源易控可停止为您提供支付结算服务，并要求您赔偿实际损失及主张实际损失的费用。'
          },
        ]
  },
  {
    'paragraphTitle': '十三、协议修订、解除和终止',
    'paragraphContent':
        [
          {
            'content': '1. 源易控可能随时会对本协议进行变更，由于源易控的用户群过于庞大和分散，因此如发生变更，源易控将按照法律规定选择在源易控网站以公告的方式予以公布而不再另行单独通知您。若您在本协议变更生效后继续访问源易控网站及其相关网站、源易控移动设备客户端，或使用源易控提供的任一服务，这代表您已充分阅读、理解并接受修改后的本协议并受之约束。'
          },
          {
            'content': '2.在本协议有效期内，甲、乙双方通过协商一致，可以解除本协议。'
          },
          {
            'content': '3.在本协议有效期内，如您违反法律法规或本协议的约定，源易控可以采取暂停提供服务、暂停结算等临时措施，经源易控书面通知后10天内您仍未改正的，源易控可以书面通知您解除本协议，但本协议另有约定的除外。'
          },
          {
            'content': '4.在本协议有效期内，如源易控违反法律法规或本协议的约定，经您书面通知后10天内源易控仍未改正的，您可以书面形式通知源易控解除本协议，本协议另有约定的除外。'
          },
          {
            'content': '5.当您发生下列任一情形的，源易控可以书面形式通知您解除本协议，若给源易控或其他损失方造成损失的，您应当向源易控或其他损失方承担赔偿责任：'
          },
          {
            'content': '（1）因违反法律法规，被有关机构查处或被司法机关立案或介入调查；'
          },
          {
            'content': '（2）被监管机构、银行卡组织认定为不良用户，或您在监管机构的风险信息管理系统中存在不良信息；'
          },
          {
            'content': '（3）利用源易控的支付服务实施违法活动的。'
          },
          {
            'content': '6.本协议终止后，甲、乙双方应当遵循诚实信用的原则，继续履行通知、协助、保密的义务，并妥善处理结算事宜。源易控在协议有效期内因提供支付服务收取的服务费用，不因协议终止而返还。'
          },
        ]
  },
  {
    'paragraphTitle': '十四、有效期及其他条款',
    'paragraphContent': [
      {
        'content': '1.本协议自您通过源易控网站或平台勾选或点击接受并同意之日起生效，有效期至本协议被解除或终止之日。'
      },
    ]
  },
];
</script>

<style scoped>

</style>
